{
    "format": "layers-model", 
    "generatedBy": "keras v2.13.1", 
    "convertedBy": "TensorFlow.js Converter v4.11.0", 
    "modelTopology": {
        "keras_version": "2.13.1", 
        "backend": "tensorflow", 
        "model_config": {
            "class_name": "Sequential", 
            "config": {
                "name": "sequential", 
                "layers": [
                    {
                        "class_name": "InputLayer", 
                        "config": {
                            "batch_input_shape": [null, 20, 200, 200, 3], 
                            "dtype": "float32", 
                            "sparse": false, 
                            "ragged": false, 
                            "name": "conv_lstm2d_input"
                        }
                    }, 
                    {
                        "class_name": "ConvLSTM2D", 
                        "config": {
                            "name": "conv_lstm2d", 
                            "trainable": true, 
                            "dtype": "float32", 
                            "batch_input_shape": [null, 20, 200, 200, 3], 
                            "return_sequences": true, 
                            "return_state": false, 
                            "go_backwards": false, 
                            "stateful": false, 
                            "unroll": false, 
                            "time_major": false, 
                            "filters": 4, 
                            "kernel_size": [3, 3], 
                            "strides": [1, 1], 
                            "padding": "valid", 
                            "data_format": "channels_last", 
                            "dilation_rate": [1, 1], 
                            "activation": "tanh", 
                            "recurrent_activation": "hard_sigmoid", 
                            "use_bias": true, 
                            "kernel_initializer": {
                                "module": "keras.initializers", 
                                "class_name": "GlorotUniform", 
                                "config": {"seed": null}, 
                                "registered_name": null
                            }, 
                            "recurrent_initializer": {
                                "module": "keras.initializers", 
                                "class_name": "Orthogonal", 
                                "config": {
                                    "gain": 1.0, 
                                    "seed": null
                                }, 
                                "registered_name": null
                            }, 
                            "bias_initializer": {
                                "module": "keras.initializers", 
                                "class_name": "Zeros", 
                                "config": {}, 
                                "registered_name": null
                            }, 
                            "unit_forget_bias": true, 
                            "kernel_regularizer": null, 
                            "recurrent_regularizer": null, 
                            "bias_regularizer": null, 
                            "activity_regularizer": null, 
                            "kernel_constraint": null, 
                            "recurrent_constraint": null, 
                            "bias_constraint": null, 
                            "dropout": 0.0, 
                            "recurrent_dropout": 0.2
                        }
                    }, 
                    {
                        "class_name": "MaxPooling3D", 
                        "config": {
                            "name": "max_pooling3d", 
                            "trainable": true, 
                            "dtype": "float32", 
                            "pool_size": [1, 2, 2], 
                            "padding": "same", 
                            "strides": [1, 2, 2], 
                            "data_format": "channels_last"
                        }
                    }, 
                    {
                        "class_name": "TimeDistributed", 
                        "config": {
                            "name": "time_distributed", 
                            "trainable": true, 
                            "dtype": "float32", 
                            "layer": {
                                "module": "keras.layers", 
                                "class_name": "Dropout", 
                                "config": {
                                    "name": "dropout", 
                                    "trainable": true, 
                                    "dtype": "float32", 
                                    "rate": 0.2, 
                                    "noise_shape": null, 
                                    "seed": null}, 
                                    "registered_name": null, 
                                    "build_config": {
                                        "input_shape": [null, 99, 99, 4]
                                }
                            }
                        }
                    }, 
                    {
                        "class_name": "Flatten", 
                        "config": {
                            "name": "flatten", 
                            "trainable": true, 
                            "dtype": "float32", 
                            "data_format": "channels_last"
                        }
                    }, 
                    {
                        "class_name": "Dense", 
                        "config": {
                            "name": "dense", 
                            "trainable": true, 
                            "dtype": "float32", 
                            "units": 2, 
                            "activation": "softmax", 
                            "use_bias": true, 
                            "kernel_initializer": {
                                "module": "keras.initializers", 
                                "class_name": "GlorotUniform", 
                                "config": {
                                    "seed": null
                                }, 
                                "registered_name": null
                            }, 
                            "bias_initializer": {
                                "module": "keras.initializers", 
                                "class_name": "Zeros", 
                                "config": {}, 
                                "registered_name": null
                            }, 
                            "kernel_regularizer": null, 
                            "bias_regularizer": null, 
                            "activity_regularizer": null, 
                            "kernel_constraint": null, 
                            "bias_constraint": null
                        }
                    }
                ]
            }
        }, 
        "training_config": {
            "loss": "categorical_crossentropy", 
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper", 
                        "config": {
                            "name": "accuracy", 
                            "dtype": "float32", 
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ], 
            "weighted_metrics": null, 
            "loss_weights": null, 
            "optimizer_config": {
                "class_name": "Custom>Adam", 
                "config": {
                    "name": "Adam", 
                    "weight_decay": null, 
                    "clipnorm": null, 
                    "global_clipnorm": null, 
                    "clipvalue": null, 
                    "use_ema": false, 
                    "ema_momentum": 0.99, 
                    "ema_overwrite_frequency": null, 
                    "jit_compile": false, 
                    "is_legacy_optimizer": false, 
                    "learning_rate": 0.0010000000474974513, 
                    "beta_1": 0.9, 
                    "beta_2": 0.999, 
                    "epsilon": 1e-07, 
                    "amsgrad": false
                }
            }
        }
    }, 
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin", 
                "group1-shard2of2.bin"
            ], 
            "weights": [
                {
                    "name": "conv_lstm2d/kernel", 
                    "shape": [3, 3, 3, 16], 
                    "dtype": "float32"
                }, 
                {
                    "name": "conv_lstm2d/recurrent_kernel", 
                    "shape": [3, 3, 4, 16], 
                    "dtype": "float32"
                }, 
                {
                    "name": "conv_lstm2d/bias", 
                    "shape": [16], 
                    "dtype": "float32"
                }, 
                {
                    "name": "dense/kernel", 
                    "shape": [784080, 2], 
                    "dtype": "float32"
                }, 
                {
                    "name": "dense/bias", 
                    "shape": [2], 
                    "dtype": "float32"
                }
            ]
        }
    ]
}